using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MorzeCoderAndDecoder
{
    internal struct DictionaryRussianMorze
    {
        public Dictionary<char, string> MorzeCode { get; private set; }
        public DictionaryRussianMorze()
        {
            MorzeCode = new Dictionary<char, string>
            {
                {'А', ".-"}, {'Б', "-..."}, {'В', ".--"}, {'Г', "--."},
                {'Д', "-.."}, {'Е', "."}, {'Ё', "."}, {'Ж', "...-"},
                {'З', "--.."}, {'И', ".."}, {'Й', ".---"}, {'К', "-.-"},
                {'Л', ".-.."}, {'М', "--"}, {'Н', "-."}, {'О', "---"},
                {'П', ".--."}, {'Р', ".-."}, {'С', "..."}, {'Т', "-"},
                {'У', "..-"}, {'Ф', "..-."}, {'Х', "...."}, {'Ц', "-.-."},
                {'Ч', "---."}, {'Ш', "----"}, {'Щ', "--.-"}, {'Ъ', "--.--"},
                {'Ы', "-.--"}, {'Ь', "-..-"}, {'Э', "..-.."}, {'Ю', "..--"},
                {'Я', ".-.-"},
                // Digits
                {'0', "-----"}, {'1', ".----"}, {'2', "..---"},
                {'3', "...--"}, {'4', "....-"}, {'5', "....."},
                {'6', "-...."}, {'7', "--..."}, {'8', "---.."},
                {'9', "----."},
                // Punctuation
                {',', "--..--"}, {'.', ".-.-.-"}, {'?', "..--.."},
                {'!', "-.-.--"}, {'-', "-....-"}, {'/', "-..-."},
                {'(', "-.--."}, {')', "-.--.-"}, {'"', ".-..-."},
                {':', "---..."}
            };
        }
    }
}
